{
    "bethpageblack":{
        "Holes":["The opening hole requires a choice right off the bat, lay back with something less than a driver or challenge the rather severe dogleg right. The front third of this putting green is severely sloped back to front, which will likely bring balls played short and with spin back to the very front of the green.","At 389 yards, the second hole is the only par 4 measuring less than 400 yards. The ability to curve the ball off the tee around the large oaks will be of great benefit in widening the fairway. The green is perched up on a ridge, so only the top half of the flagstick is visible for the short iron approach shot.","A new teeing green has been added since the 2002 U.S. Open, making this hole the longest par 3. At 241 yards, the third plays to a diagonally set green effectively making it fairly shallow in depth. Recovery shots require a great touch since the putting green falls off in all directions. The putting green itself is relatively flat.","Perhaps Bethpage's best hole in terms of beauty and strategy, the fourth is a par 5 measuring 517 yards. This is a birdie hole that will give players options. It can be played conservatively as a three shotter or may be challenged in two. The green, which slopes front to back away from the player, is not particularly receptive to approaches from the lower drive zone.","At 478 yards, the par 4 fifth will be one of the toughest holes. The downhill tee shot is played to a fairway that sits at a slight left to right diagonal. Tee shots must hug the right side cross bunker in order to not be blocked by large, overhanging oaks left of the hole. The green is relatively small and slopes back to front. Par is a good score here.","Most players will lay up their tee shots to the top of the hill overlooking the green. This will leave mid irons to the green that sits some 50 feet below the drive zone. However, the USGA converted the hillside from rough to fairway since 2002, allowing for the option to drive to the bottom of the hill. This par 4 should yield a fair amount of pars and birdies.","With a new teeing ground that added 36 yards since 2002, the 525 yard seventh will play as the longest par 4 in U.S. Open history. Long irons and hybrids will be used for approach shots to a green that is closely guarded by a deep bunker on the front right. Par will be an excellent score on what will likely be the toughest hole on the front nine.","This downhill one shotter will likely end up being the most exciting of the par 3s. The hole location in the front requires players to carefully consider just how aggressive they want to be with their tee shots. However, conservative play off the tee will call for a deft putting touch coming back down the hill to the front portion of green.","No tee shot has changed more since 2002 than the one at the ninth hole. Since Rees Jones' installation of a new teeing ground some 40 yards back and a new left bunker, most approach shots will now be played from a severely sloping right to left lie to a green that is mostly blind. The putting green is fairly large and flat.","At 508 yards, the 10th is one of three par 4 holes measuring more than 500 yards, a first for any U.S. Open. A slight dogleg to the left, the hole's location on the course exposes it to the wind and also exposes errant tee shots to the fine fescue grasses in the rough. Deep bunkers guard both sides of the drive zone. A par on this hole will be a very good score.","Like the 10th, this straight away, 435 yard hole is out in the open and exposed to the winds. The tee shot is played to a somewhat blind fairway with deep bunkers guarding both sides. The mid to short iron approach shots must be played beneath the hole. The putting green is one of the Black Course's most difficult, sloping steeply from back to front.","The last of a difficult three hole stretch, this 504 yard par 4 played as the second hardest during the 2002 U.S. Open. Landing the fairway from the tee is crucial as there is commonly a left to right prevailing wind against. The putting green is one of the largest on the course, but has a pronounced tier separating the front and back of the green.","At 605 yards, the 13th is the longest hole on the course but still reachable in two shots by longer hitting players. The bunker that appears to front the green is actually about 30 paces short, allowing for run up approaches. The green slopes generally back to front. Birdies and even eagles are a possibility, but overly aggressive play may translate into bogey.","At 159 yards, the 14th is the shortest and should be the easiest of the four par 3s. A miss short will likely take birdie out of play while a miss long over the green will almost certainly take par out of the equation. The 14th is still a birdie hole, but a mediocre tee shot may make par challenging.","At 458 yards, the slight dogleg 15th is not the Black Course's longest par 4, but it will likely again be the toughest hole for the U.S. Open. Finding the fairway off the tee will be crucial to having a realistic chance to reach the green in regulation. The 15th putting green is without a doubt the scariest on the course as it slopes severely from the back left to the front right.","This gentle dogleg left 490 yarder is played from high up on a teeing ground that overlooks the entire hole. The green is guarded by deep bunkers that partially obscure the view on approach shots. The putting surface has \"bowl like\" features on the right and left, making both recovery shots and putts a challenge.","The 207 yard 17th plays uphill to an hourglass shaped putting surface that is mostly blind from the teeing ground and is surrounded by deep bunkers. The putting green is very wide but relatively shallow in depth and is bisected by a ridge that separates two distinct tiers. The 17th is sure to be an exciting hole that might greatly impact the outcome on the final day.","The home hole provides a dramatic finish. The downhill tee shot on this 411 yard par 4 gives the player a choice, lay up short of the deep cluster of bunkers or be more aggressive off the tee and attempt to drive his ball between or beyond the bunkers. The uphill approach shot is played to a blind putting surface that cants from back to front."]
    },
    "torreypines_20_FC":{
        "Holes":["Favor left side of fairway on tee shot to leave an open look at the green. A good tee shot will leave a mid to long iron approach to green protected by two green side bunkers. Don't go long on your approach, as it will leave you a difficult pitch to get up and down. A par on this hole is a great way to start your round.","3 wood or hybrid is recommended on this short but demanding par 4. Favor the left side of the fairway. Avoid going right as it will leave you a blind second shot amongst a small grove of Torreys. Good tee shot leaves you a short iron into a green protected by two massive bunkers.","Overlooking La Jolla, South Course's signature Par 3, is the most picturesque of all the Par 3's on the course. Club selection is of utmost importance as the hole can play as short as a 9 iron, and as long as a hybrid. Playing downhill, a good tee shot will leave you middle of green. Avoid going long here as it will leave you a very difficult pitch to get up and down.","The second longest of the daunting Par 4's at Torrey Pines, hole #4 requires a good tee shot that will leave you a long iron or fairway metal into a green protected by a bunker on the left. Play approach to the right of the green to allow the contours of the green complex to feed the ball to the middle of the green. A par here is a good score.","A good tee shot will leave you beyond the rise and past both fairway bunkers leaving you mid iron into a green protected by two greenside bunkers.","Playing downwind this dogleg right Par 5 requires a tee shot that favors the right side to avoid the fairway bunkers on the left. A good layup shot will leave you a wedge into a two tiered green.","This dogleg right Par 4 requires a tee shot that favors the left side. A good tee shot will leave you a mid iron approach to an elevated green that slopes severely back to front. Don't go long here and avoid the massive greenside bunker on the right. As with all the Par 4's, par is a good score here.","Add an extra club on this uphill Par 3 to avoid the bunker protecting the front of this green.","Grip it and rip it! What you see is what you get with this straight Par 5. The par 5 is reachable by only the longest hitters, so most players must hit the fairway from the tee to allow an aggressive lay up, which in turn will allow an accurate third shot and a chance to make birdie.","The best way to start the second nine with a birdie is to hit left center of the fairway from the tee, then hit a short iron to a sloping green that is guarded by bunkers on the front left and right.","Club selection is key on this long downhill Par 3. This par 3 usually plays several yards longer than its official yardage because it plays into and across the prevailing wind. Don't look for many approach shots to come to rest in the center of the green, as a severe slope will filter shots from right to left.","A generous fairway invites players to be aggressive off the tee. Anything less than a well struck drive won't allow this green to be reached in two. The ideal position for those who miss the green is short, since the green, which runs some 35 yards deep, is receptive to uphill chip shots.","A new tee has been added, back and to the left, calling for a drive of at least 240 yards to carry the canyon. Should players choose to go for the green in two, they will need to carry the second shot some 260 yards as the green is elevated and protected by bunkers and rough in front.","With the canyon running all along the left of the fairway, players will be sure to play the ball safely out to the right, probably with a fairway wood. The most difficult hole location will be back right, but any shots missed long could result in bogey or worse, as there are hazards just off the back of the green.","Players who shape their shots will not find much room here. Eucalyptus trees protect both sides of this tight fairway and the slightly uphill green slopes aggressively from right to left. Shots coming from the right had better land softly if a player wants to have putter in hand for his third shot.","Two teeing grounds will have a dramatic effect on how this hole is played. The shorter tee, to the left, brings two greenside bunkers into play, but players can aim right and ride the prevailing breeze. The front of the green is open from the longer tee, but the wind can complicate the angle.","A high draw from the tee will take the fairway bunker on the right, 275 yards to the front of it, out of play. That will leave a middle to short iron approach to an elevated, wide, and severely undulating green protected by two bunkers in front."," The closing hole is a great par 5, basically straight but with a twist in the drive zone on which anything can happen. Just ask Bruce Devlin. In contention for the 1975 Andy Williams San Diego Open, the Australian took six hacks to get his ball out of the water in front of the green on his way to making a 10. The pond is now called \"Devlin's Billabong\"."]
    },
    "wolfcreek_18_FC":{
        "Holes":["Teeing off from an elevated tee there is a fairly generous fairway with room to the right. There's a hidden water hazard over the fairway bunkers on the right for your second shot. If going for the green don’t miss it on the side the flag is on. Once on the green there are 3 tiers sloping back to front. Good chance to make par or better.","Another tee box well above the fairway. The high percentage shot is out to the right side of the fairway. Remember it will play shorter because of the elevation. This will leave you an approach to an uphill two tier green that slopes from back to front.","Uphill par 3 that will play longer than the tee marker says. A high soft shot is required to hit the green. Anything on the green is a great shot.","One of the few flat holes at Wolf Creek and a big risk reward opportunity. With an accurate drive hitting the green is possible, but with the slightest mishit or push a big number is brought into play. The smart play is straight down the fairway which will leave a short approach to a small well guarded green.","Hole 5 is a reachable par 5 with an elevated tee box. The fairway slants away from tee box and the further left you go the more carry is required. The aggressive play over the rocks will leave a short shot into the green and a birdie is a real possibility. A large slope bisects the green and over the green presents a straight downhill chip.","Tee off from an elevated tee with Wolf Creek cutting across the fairway at 270 yards. You have a choice to either hit it over the creek or lay up short. The green is 34 yards long with a large slope in the back right of green.","Another hole that can be driven. If successful you'll have a great opportunity for birdie, but if not double bogey or worse is a real possibility. A long carry is required and anything short of the green will roll off the false front into the water. Distance control is very important.","The most picturesque par 3 on the course and the most challenging. The hole plays downhill with water on three sides so accuracy is crucial. The only bail out is to the right of the green.","A little uphill par 4 with reachable deep fairway bunkers. A good drive should carry all the bunkers leaving a short wedge shot to a three tier green. Make sure to hit the tier where the hole is located.","The longest par 4 on the course. The tee shot plays a touch uphill and you will want to favor the right side where there is more room. The green is long and well guarded by bunkers. A par on this hole is a great score.","Another picturesque par 3 from an elevated tee. The green slopes from back to front. If indecisive about club selection take one less. It is easier to get up and down from the front.","A reachable downhill par 5. Anything left of the fairway will end up in the water so favor the right side off the tee. Going for the green in 2 requires one of the most precise long shots on the course. The hole has a three tier green.","Long hitters can carry the large hill to the right of the fairway and hit the green. The safe shot is a well placed tee shot in the fairway which leaves an uphill wedge shot to the green. The front of the green has a very severe slope.","One of the most often photographed holes on the course. A long drive just to the right of the fairway bunkers will leave a short uphill shot to a narrow well bunkered green.","Don’t sleep on this short straight forward par 3. The right side of the green is severely sloped to the left and any shot left in those deep bunkers is very difficult to get up and down.","This is a difficult fairway to hit. Anything to the right or left of the fairway will end up at the bottom of the canyon. An accurate straight drive will yield a straight forward short iron shot into the green.","A very picturesque par 5. One of the most elevated tee shots on the course with danger on both sides. Be careful of the well positioned creek crossing the fairway. A good drive short of the creek will leave a long approach to a green with trouble on 3 sides.","This hole can be driven with a great tee shot. However the conservative shot is a 210 yard shot just to the left of the right fairway bunker which will leave 120 yard shot to a three tier green. Distance control on the second shot is of the utmost importance."]
    },
    "erinhills_16_FC":{
        "Holes":["The opening tee shot skirts the wetlands, and the fairway is canted from left to right toward it. Favor the right side of the fairway, but be wary of the cluster of bunkers 50 yards short of the green. This green favors a run up shot more than any other on the course.","This classic strategic hole allows the player who successfully challenges the left side of the fairway an unobstructed view of the smallest green on the course. Those who lay up short of the fairway bunkers from the tee will be left with a blind approach shot.","Bunkers challenge the tee shot on the first long par 4, and the fairway slopes from right to left in the landing area. On the uphill approach shot, there is more room than appears between the front bunker and the green, which features a pronounced ridge.","This demanding tee shot must negotiate challenging rough on the left and an encroaching bunker on the right. More bunkers could influence the second shot, which is played over a central bunker to a shallow putting surface with wetlands just behind it.","The surroundings here perhaps best capture the distinctive character of Erin Hills. The slight dogleg left hole favors a right to left tee shot, as the approach from the right side is likely to be blind. It is possible to use the slope on the left to bounce the ball onto the putting surface.","The prevailing westerly wind is at the player’s back, and only the front one third of the green is visible from the tee, with much of the rest of the putting surface sloping to the rear. Getting close to a hole location on the front part of the green is particularly challenging.","This rolling three shot hole plays past the bell that had been used to signal the “all clear” on the now defunct par 3 Dell Hole. Several bunkers dot the area where players would likely hit a lay up shot, and the elevated green is two tiered, with a plateau on the left side.","Similar to several holes at The Olympic Club, the landing area on this right to left dogleg slopes from left to right. Players who can shape their tee shots with a draw will have an advantage. The approach shot is to a shallow green that slopes from back to front and is flanked by three bunkers.","Club selection can be challenging on the shortest hole on the course, which plays from an elevated tee. The green angles and slopes from left to right, making it somewhat of a mirror image Redan design. Saving par will be particularly challenging for those who miss long or left.","Despite the blind tee shot, the expansive fairway encourages the player to swing freely. A downslope in the fairway can help the drive get closer to the shallow green, which is heavily protected on the right. The closely mown area to the right and behind the green can be used as a backstop to work the ball closer to the hole.","After a number of demanding holes, No. 11 provides the player with a bit of a breather, with a generous fairway and an approach that is typically just a short iron. However, care must be taken with the small green that slopes from left to right. The back nine of Erin Hills presents several challenging par 4 holes of varying length.","With its dramatic topography and partially hidden green, this hole showcases the minimalist approach that the architects took in creating Erin Hills. The tee shot must reach a plateau to afford the player a shorter approach shot to a green set in a hollow. Players who take an aggressive line on this dogleg right tee shot could be rewarded with a shorter approach shot.","This hole is a rendition of the classic hill to hill par 3. The player’s eyes are naturally drawn toward the expansive bunker to the left of the green, to which a swale on the left side of the green directs errant shots. But the green also falls away to the front, right and back, making a miss in those directions difficult to recover from.","This par 5 provides a gambling opportunity for the bold player. The player who lays up with their second shot faces a nearly blind approach to a green that is set at an awkward angle. The player who fails in the attempt to reach the green with their second shot will have no bargain, with thick rough short of the green and a false front combined with a steep drop off to the right that runs toward a small stream.","This strategic short par 4 presents the player with several options: lay up short of the three fairway bunkers, place the tee shot between the bunkers, or try to reach the elevated green from the tee. The dramatic drop off to the right of the green will influence players to keep their approach to the left, but a ridge that runs through the green will leave a difficult two putt for the player who has to negotiate it.","This narrow, slightly angled green is nestled against the hillside to its left. A player might assume that the hillside will help to kick the ball onto the putting surface, but there are hidden bunkers at the base of the hill that can ensnare a ball that is bouncing off the hillside.","A tee shot down the right side of the fairway will provide the player with a clear view of the green, which is tucked behind a hill on the left. Those who play down the left side of the fairway will face a partially blind approach. This hole has no bunkers, relying on the natural terrain to defend the putting surface and repel inaccurate approach shots.","The closing hole at Erin Hills features Holy Hill in the distance. The natural tendency is to play toward the green on this long par 5, but the player is well advised to play to the right on their second shot. A cluster of bunkers visually dominates the approach shot, but players need to be careful not to miss the green to the left, where the slope will take the ball well away from the putting surface."]
    },
    "chambersbay_14_FC":{
        "Holes":["The par 4 opening hole at Chambers Bay provides a very manageable start to the round. Most tee shots will finish short of the crest of the hill in the fairway, leaving a partially blind second shot. Approach shots must favor the right side and can utilize the contours along that side of the fairway to find the putting surface.","The tee shot on this medium length par 4 plays through the dunes to a narrowed fairway. The shortest approach is from the left side of the fairway, but that route brings a large bunker into play. Play down the right side to take advantage of an open entrance to the green, which slopes from right to left and is bisected by a large ridge.","The first of the short holes at Chambers Bay is a mid iron for most players. The kidney shaped green is guarded on the left by a deep bunker and a swale off the putting surface collects shots struck too long. A large kick slope on the right redirects shots toward the center of the green.","The fairway on this medium length, uphill par 5 slopes significantly from left to right. The green is reachable in two shots for long hitters, though tee shots must avoid the immense bunker on the right. The green complex is framed by a large bunker front and right with three blowout bunkers behind. The large and heavily contoured green features a right hand hole location bordered on three sides by sand.","The elevated fifth tee offers players a panoramic view of Puget Sound and Chambers Bay. This long straightaway hole rewards a drive down the center. While the fairway is generous, massive bunker complexes protect either side. Tee shots that land left of center will chase toward the bunker and be faced with a semi blind approach. The green on this long par 4 is guarded by a deep fronting bunker.","Depending on the placement of the tee markers, the sixth hole is either a long, dogleg right or a short straightaway par 4. Regardless, favor the left side for an unobstructed view of a green perched between two bunkers. The slope from back to front encourages a low running approach.","This long uphill par 4 turns hard from left to right. Taking an aggressive line over the large bunker on the right invites a shorter approach to the green, but also brings trouble into play. Tee shots played safely to the left will face a blind approach over the hummocks fronting the green. The severely uphill approach plays much longer than the actual yardage.","This fairway is much wider than it appears from the tee, but does slope from left to right. A drive struck down the left side of the fairway will be redirected to the middle, offering an open view of a long and narrow green. Contours to the left and in the back of the green will move approach shots back toward the center of the green.","The teeing ground on this long par 3 is perched nearly 100 feet above the green. The oversized green slopes from left to right, providing assistance to players hoping to avoid the menacing bunker short and right of the putting surface. The contours on and around the green provide ample opportunity to get close to the hole. An alternate, lower tee has been installed to provide variety in setup for the U.S. Open.","This medium length par 4 splits the two largest dunes on the golf course. The fairway narrows steadily the closer one comes to the green, making club selection off the tee crucial. A relatively flat green is nestled between the dunes and is flanked by deep bunkers front right and back left.","This long par 4 plays straightaway, while the fairway curls in and around the dunes and waste areas. A tee shot over the central fairway dune leaves a middle to long iron approach. The green is set into a slope from right to left and features a ridge bisecting the surface lengthwise.","An uphill, drivable par 4, the 12th is the narrowest hole on course. Lay up short or challenge the blowout bunker fronting the green. A very large and undulating green set in a punchbowl requires an accurate approach or lag putt. Strong contours all around this green invite creativity and imagination into your short game.","The placement of the tee shot is critical on this strong, dogleg right par 4. Though the fairway is the widest on the course, a tee shot down the right significantly reduces the length of the approach. A central bunker requires players to carefully choose their line of attack on the approach. Shots struck off line will be rejected by the knob on the left of the green, or a slope falling away on the right.","The first task on this dramatic downhill par 4 is to decide how aggressive you wish to be off the tee. A large, deep waste area must be carried onto a fairway sloping from right to left. Mounding short and right of the putting surface will funnel shots onto a large green that tilts toward the fairway in front, but then slopes away toward a collection area beyond.","This short par 3 plays from an elevated tee and is fully exposed to the prevailing wind, making club selection critical. The well defended green slopes from left to right. Standing watch in the distance, the Lone Fir is the only tree on the course.","This medium length par 4 curves gently around a long bunker that flanks the entire right side of the hole. Tee shots should favor the left side to account for slope toward the bunker. The tabletop green is the smallest on the course and also slopes dramatically from left to right.","With two distinct teeing grounds, this picturesque par 3 plays into the prevailing breeze. The lower tee offers a level shot and requires a long carry over the waste bunker, while the upper tee provides a drop shot with full view of the green and its surrounds. The putting surface is split into obvious halves, allowing only accurately struck shots near the hole.","The home hole is a slightly uphill par 5, surrounded by dunes. The remnants of vast concrete sorting bins loom over the teeing grounds. After navigating a fairway dotted by bunkers and swales, built to accommodate play as a par 4 or par 5 during the U.S. Open, a large green featuring multiple levels and strong contours awaits. Imagination and a deft putting touch are required to pass the final exam in this championship test."]
    },
    "bestofbandonpar3_13_FC":{
        "Holes":["Club selection is crucial to this shallow, firm green. A sod faced bunker awaits short shots, and natural fescues approach quickly from behind. A shot played into the front right opening of the green will serve you well to any hole location.<span>Specific Course and Hole: Bandon Dunes #12.</span>","The shortest hole on Old Macdonald plays to one of the largest greens. Pay particular attention to the hole location as there are several distinct areas to leave your golf ball. When in doubt, aim for the center of the green.<span>Specific Course and Hole: Old Macdonald #5.</span>","This hole features a back to front sloping green with a large deep bunker guarding the front. A shot played to the back half of the green is the prudent play. The cross wind places an emphasis on yardage.<span>Specific Course and Hole: Bandon Preserve #2.</span>","Judging the impact of elevation change and wind will make club selection critical on this par three. The place to miss, although not visible from the tee, is short and left of the green. Par will be a struggle after any tee shot that misses right of this green.<span>Specific Course and Hole: Bandon Trails #2.</span>","With a prevailing wind at your back, you will need to play this hole significantly shorter than the actual yardage. A shot slightly left of this green will filter down onto the putting surface. This two tiered green will challenge even the best putters.<span>Specific Course and Hole: Pacific Dunes #5.</span>","This hole plays downhill to a shared green complex. Carrying the mound in front is essential to safely finding your way away from trouble and onto the green.<span>Specific Course and Hole: Bandon Preserve #4.</span>","Playing from an elevated tee, this green has a deep swale that will come into play for most players. The best shots will be played with a lower trajectory and land short of the swale, rolling down and through to the back third of the green. A two putt on this hole is a feat of its own.<span>Specific Course and Hole: Old Macdonald #8.</span>","Don’t let the length of this hole give you a false sense of security. Club selection is critical, as your ball must end up on the same tier of the green as the hole. This green is the most undulating on the course, and a two putt will be well earned.<span>Specific Course and Hole: Bandon Trails #5.</span>","With the most dramatic elevation change at Bandon Preserve, this hole offers spectacular views of the Pacific Ocean. The prevailing wind will challenge a high ball flight. Avoid left as it slopes severely away from the green.<span>Specific Course and Hole: Bandon Preserve #5.</span>","The biggest obstacle at this hole besides the distraction of the scenery is the thick rough and mounding left of the green. A large elevation change from the upper tee combined with the prevailing wind, make club selection critical on this par 3. A safe place to leave your approach is short of the green.<span>Specific Course and Hole: Pacific Dunes #10.</span>","This short par 3 is a strong challenge. The green is surrounded by native beach grass, bunkers, and gorse. Forget about the hole location and focus on getting your ball in the center of this green, the smallest at Pacific Dunes.<span>Specific Course and Hole: Pacific Dunes #11.</span>","Against the prevailing wind, this hole requires much more club than the yardage suggests. Beware of the deep, sod faced bunker on the left. A missed shot to the right of the green leaves a manageable chip to save par.<span>Specific Course and Hole: Bandon Dunes #6.</span>","A stout par three that plays into a plateau green running from front right to back left. Players who can land their ball on the front right and chase it back will have the best chance at making par.<span>Specific Course and Hole: Old Macdonald #12.</span>","An approach that misses the green on this par 3 leaves one of the most difficult up and downs on the course. Figure your yardage to the front of the green, because balls will certainly release to the hole.<span>Specific Course and Hole: Pacific Dunes #14.</span>","A par three framed by a menacing bunker right and two bunkers back and left. A false front forces you to fly the ball well onto the green. However, the green will feed balls into an open collection area long and right of the green, from which a par is manageable. A prevailing crosswind makes it all the more difficult to launch a high, soft shot on to this green.<span>Specific Course and Hole: Bandon Trails #17.</span>","Favor the left side of this green, as the deepest bunker on Bandon Dunes lurks on the right. The bank on the left will feed all shots toward the center of the green.<span>Specific Course and Hole: Bandon Dunes #15.</span>","Deep bunkers protect the left front of the green, with a steep ridge running along the back. Keeping your ball to the right is the prudent play.<span>Specific Course and Hole: Pacific Dunes #17.</span>","Spectacular views of the Pacific Ocean and back 9 of Bandon Preserve make this an overwhelming tee shot. Pay attention to the elevation change as distance control is essential. The mound left of the green can provide forgiveness. Sensory overload is the cause for a miscue on this hole.<span>Specific Course and Hole: Bandon Preserve #9.</span>"]
    },
    "pebblebeach_14_FC":{
        "Holes":["Take aim at the right edge of the first bunker beyond the fairway and try not to cut the dogleg, it doesn't pay. The approach shot plays somewhat longer than the actual yardage and the green is tightly bunkered left and right.","Find the fairway long off the tee and you can reach the green in two. Another option is to lay up short of the deep bunker or barranca hidden 75 yards from the green.","A slight draw around the corner of this dogleg leaves you in perfect position for a short pitch to the green. If you play it safe to the far right of the barranca, be prepared to contend with the bunkers flanking the right side of the green.","A long iron or 3 wood to carry the long bunker in the center of the fairway is your best bet. This short hole is tightly guarded with a cluster of menacing bunkers and the green slopes decidedly back and front.","Opened for play in January 1999, this spectacular addition is sure to test your mettle. Designed by Jack Nicklaus, this beautiful par 3 sits naturally upon the bluffs overlooking Stillwater Cove. The ocean breezes will affect club selection. The safest play is to the left center of this green.","The optimum placement for the tee shot is left center of the fairway. Your second shot must carry the steep slope but beware of the bunkers on the left.","Club selection is predicated on wind factors. Knock down a short iron and keep the ball from ballooning in the wind. Play it safe to the middle of the green.","Tee it up over the aiming rock and note wind conditions. A well placed drive will leave you with a middle iron shot across a deep oceanic chasm. Take a deep breath and fire to the middle of the green here, but take heed: this green is sloped severely from back to front.","Take aim at the left center of the fairway, hit it long and beware of the left side. Side hill lies are the norm for long iron second shots so beware of the ocean on the right. There is a deep bunkered gully left and short that will punish a timid approach. This is truly the most difficult hole on the course.","A strong tee shot to the left center of this sloping fairway will leave you with a medium iron shot. Take enough club on your approach to carry the inlet on the right. Bunkers left and long will capture errant shots. The green slopes from left to right.","A well struck tee shot will take you left of center, avoiding the bunkers left and right on your approach. Take enough club on this uphill approach, but be careful not to over club. This green is fast from back to front.","The staggered bunkers in front give a false perspective on this long par 3. Club selection is key in approaching this wide but shallow green. The wind above the trees, undetectable by eyeing the 12th green, may alter your shot.","This uphill par 4 plays longer than the yardage. Line up over the right edge of the fairway bunker and hit your best tee shot. The uphill approach shot calls for an extra club. Shots to the right side of the green will slide left on this, the most severely sloped and quickest green on the course.","The dogleg right is a three shot hole for virtually all players. A well placed bunker on the right will capture shots aimed at cutting the dogleg. Hit as much club as possible on the second shot and if the pin is tucked upper left, take at least one extra club to carry the huge frontal bunker.","This medium length par 4 sets up perfectly for an accurate tee shot. A well placed drive in the center of the fairway will leave you with a medium to short iron. Remember: Check the ocean left, as putts will move in this direction.","Take aim directly over the island bunker with a 3 wood or long iron. A driver may leave you with a difficult downhill, sidehill, or worse yet, in the deep rough through the fairway. Do not attempt to cut the dogleg, the right side is fraught with danger. Hit the approach to the right side of the green, as all shots will slide left.","Check the pin placement and wind conditions. These two factors determine the choice of club. Beware the ocean left.","Set up for three shots on this hole. The best tee shot is to the left of the trees. The second shot is ideally placed on the left side of the fairway to avoid the tree overhanging the green. Your short iron into the green must carry the frontal bunker. And finally, putts will tend to fall oceanside."]
    },
    "merion_12_FC":{
        "Holes":["This is one of the great opening tee shots in golf with the teeing ground situated right beside the clubhouse patio. Expect to see long irons from the teeing ground, with a few players favoring fairway metals, which would leave a wedge into the green. A sycamore tree off to the right of the tee will likely prevent players from attempting to drive the green, which pitches from back to front.","Players have a choice from the teeing ground: play the hole conservatively as a three shotter, or attack the hole with a driver or 3 wood. Out of bounds looms closely on the right, and the rough on the left is some of the deepest on the course. Eagles and birdies are real possibilities, but one mistake along the way could lead to a bogey or worse.","Although it has the most receptive green of Merion’s par threes, this is a very difficult hole. The green pitches steeply from back left to front right. Players will not want to miss the green to the left under any circumstances, as keeping a recovery shot on the green from there will be very difficult. The bunker at the front right of the green is one of the deepest on the course.","A new teeing ground has been added here, which brings the fairway bunkers into play. The tee shot features one of the most difficult drive zones to hit because of the pronounced right to left slope. Most players will lay up with an iron to leave themselves with a lofted club for their third shot to a green that slopes from back left to front right and is fronted by a creek.","This is perhaps Merion’s finest driving hole. It doglegs from right to left with a stream bordering the left fairway for the entire length of the hole. The fairway also slopes from right to left. Players must not leave their second shots right of the hole, or they will face exceptionally fast putts. Players who are able to par this hole will likely pick up close to a full stroke on most of the field.","This second consecutive difficult par 4 features a semi blind tee shot over a crest to a bowl shaped fairway. Most players will be left with a slightly uphill, mid to long iron approach shot to a green that is pitched from the back left to the front. The player will also have to negotiate a false front, requiring an approach that either bounces up onto the green or flies to the middle of the green.","This hole begins a stretch of holes that could provide several birdie opportunities. A slightly pushed tee shot brings overhanging trees and out of bounds into play on the right side. The large green is perched up on a knob and has three distinct plateaus. A severe drop off to the left will leave a difficult up and down.","Players will likely hit anything from a fairway metal to a long iron to an S shaped drive zone with thick fescue rough both left and right of the fairway. The relatively short approach shot is to a small green protected by deep rough and bunkers. The putting surface has wonderful contours and slopes from back left to front right. Iit’s a good birdie opportunity, but bogey is also a distinct possibility.","This difficult par 3 is played downhill to a kidney shaped green. Most players will hit 6 irons to the front hole location, which is deceptively tough given the water hazard that sits in front and to the right of the green. Long irons will be required to carry the left bunker and reach the back of this angled green. There will be many more bogeys than birdies on this one shotter.","Ever since Bob Jones won the Grand Slam in 1930, this has been a drivable par 4. The conservative play is a 200 yard shot from the teeing ground to the very narrow fairway. Players who attempt to drive the green and miss to the left will end up in deep fescue rough and will likely have difficulty getting the next shot onto the green.","Most players will hit a long iron or hybrid from the teeing ground on this hole, where Bob Jones completed the final leg of his Grand Slam in 1930. Those who miss the fairway will most likely be forced to lay up short of the brook, which hugs the front, right and rear of the teardrop shaped green. It’s a birdie hole if played properly, but there assuredly will be plenty of bogeys and double bogeys.","This medium length, hard dogleg right par 4 places a premium on the tee shot, to a fairway that slopes severely from left to right. The green slopes severely from back left to front right, and any approach that misses long or left will leave a treacherous up and down.","On the other three one shotters at Merion, players will be thrilled to make par. On No. 13, with a wedge in their hands, players are hoping to make birdie. However, the oval shaped green is probably the smallest on the course, with challenging contour. The player’s view of the putting surface is obscured by the huge bunker that fronts the green.","Most players will likely choose driver on this stout, uphill par 4, which features bunkers in the drive zone along with high fescue rough to the left. The approach shot will likely be with a mid iron to a large green that features wonderful contour. Approach shots that miss the green to the left are in danger of bouncing off the closely mown knoll and running out of bounds.","This is probably the most intimidating tee shot at Merion, because of the left to right dogleg and the out of bounds which is dangerously close on the left. The preferred shot shape off the tee is from left to right, but bailing out to the right into the deep bunkers or thick rough will likely result in bogey. Once the player reaches the green, his work will not end. The 15th is one of Merion’s most severely sloped greens.","Many players will hit 3 wood on the famous Quarry Hole to stay short of the hazard. The approach shot will likely be with a medium to short iron to a green that features a pronounced depression in the front right. If played properly, this is the last realistic birdie opportunity before the difficult 17th and 18th holes.","This hole, an outstanding penultimate hole in an amphitheater setting, plays slightly downhill to a green that features a pronounced ridge in the front that must be carried with the tee shot. The contours tend to feed balls to the back right portion of the green. Front hole locations are very tough.","This is one of the great finishing holes for a U.S. Open and is likely to play as the hardest hole for the week. The difficult drive is semi blind over the quarry to a landing area that pitches downhill and steeply from right to left at 300 yards out. The very challenging green is unique for Merion in that it is somewhat dome shaped; it is better to be long than short on the approach shot."]
    },
    "pinehurst2_13_FC":{
        "Holes":["This short par 4 will require something less than a driver off the tee for most players, who will likely try to play just short of the point where the fairway narrows dramatically, leaving 135-150 yards to a traditional Pinehurst No. 2 domed green. Although this is a lofted approach shot, it demands precision, with a miss in any direction likely to roll away from the hole.","This slight dogleg right par 4 played the most difficult in relation to par in the 2005 U.S. Open. The restoration has doubled the width of the drive zone, but the approach shot is to a very severe green, given the length of the hole. Players will want to play down the left side of the fairway when the hole is located on the right side of the green, which features a pronounced hump in the front that will likely repel approach shots.","When played from the regular tee, most players will lay up short of the bunker that encroaches on the right. The green sits up in the air, and a miss in any direction will leave a difficult par save, particularly on shots over the green. Players who attempt to drive this green when playing from the forward tee will need to shape a left to right tee shot, as the trees and bunkers on the right discourage a right to left shot.","The longest par 4 on the course will play shorter because of the downhill tee shot, which has been restored to the original angle that Donald Ross intended. This hole, which played as a par 5 in both previous U.S. Opens, features a dogleg left tee shot with the fairway canting from left to right. The large green is receptive to a long approach shot, and it is unusual for Pinehurst in that it slopes from right to left.","This dogleg left hole, which was a par 4 in previous U.S. Opens, will play as a par 5. With a good tee shot, most players will have a chance to go for the green in two, although they face a downhill sidehill lie for the second shot. Laying back on the second shot leaves a demanding approach, with the ball significantly above the right handed player’s feet. This is by far the toughest green to hit and putt at Pinehurst.","The first of the par 3 holes will probably play as the most difficult. This medium to long iron tee shot must carry a crease at the front that is 4 feet below the level of the green, as well as one of the deepest bunkers on the course at the front left. Hole locations toward the front of the green will be exacting, because putts from the back of the green are extremely fast.","Most players will choose a 3 wood, hybrid or long iron from the tee of this severe dogleg right hole. A left to right tee shot is preferred, as right to left tee shots will quickly run out of fairway. The mid to short iron approach shot is to a green that is protected by a deep bunker on the right and features an interesting hole location on a plateau at the front left.","This long par 4 plays straightaway, but the fairway has pronounced slopes, first downhill and from left to right, then uphill and from right to left. Players who work the ball from left to right off the tee have an advantage in being able to hold the fairway. Players will likely have a mid iron for their approach shot, and they must guard against going left of or over the green, as the falloff behind the green is 8 to 9 feet.","This hole requires a very accurate shot to a green with two distinct sections. It appears from the tee that the back left quadrant is more difficult, but that area of the green is fairly flat. The front right section of the green actually has much more slope to it. Shots that miss the green long and left will bounce away and leave the player with an almost guaranteed bogey.","A pronounced mound on the right side is in play on the straightaway tee shot, and the hole turns to the left past the drive area. Depending on tee location and conditions, a long tee shot can provide a chance to reach the green in two, but trees protect the left side, requiring either a right to left second or a towering shot over the trees. If played properly, this is a birdie hole.","The tee shot on this slight dogleg right hole is one of the more demanding on the course, to a semi blind drive zone with some left to right slope. Most players will be left with a mid iron approach shot to a green that features demanding left side hole locations, because of the steep falloff to that side of the green. Players who miss the green to the right are left with the most benign up and down on the course.","Many players will go with driver, as the slight dogleg right hole features a generous drive zone. The second shot requires precision, because the effective size of the green is quite small. Players will want to err on the short side with their approach because of the dramatic drop off behind the green. The general slope of the putting surface is from back to front, and its many subtle breaks will lead to plenty of three putts.","Most players will hit something less than driver off the tee on this short, dogleg right par 4, which features probably the most uphill approach shot on the course. Anything short of the green will leave a difficult recovery, and in a rarity for a Donald Ross course, it’s much better to be long than short of the green here. If you play it the way it should be played, this is a potential birdie hole.","The downhill tee shot favors a left to right shape to avoid the bunker on the left side of the drive zone. The prudent approach shot, with a mid iron to lofted iron, is to the front portion of the green, regardless of the hole location. Missing short leaves a fairly easy up and down, while the severe back to front pitch of the green makes recoveries from any other angle extremely difficult.","This is one of the few greens renovated by Bill Coore and Ben Crenshaw, who restored the right side of the putting surface to its original size. The green still plays smaller than any green on the course except for the fifth hole, as shots that land on the front portion will likely end up in a collection area. Recovering from the bunker on the right is difficult.","Players who favor the left side off the tee of this dogleg left hole will likely receive a forward bounce down the hill. Most players will face a slight downhill lie on their approach shot to a green with a pronounced back to front slope, particularly in the front section. Putting toward a front hole location from the back of the green will require a deft touch.","Although this hole plays a similar distance as No. 15 and will require a mid iron shot for the men, this is a much larger green that is easier to hit. Again, there is a falloff in the front portion of the green. The most exacting hole location is tucked behind the bunker on the right side. If played properly, this hole provides a legitimate chance for birdie.","The fairway appears much wider from the tee than it really is, because it makes an S turn and the landing area is slightly uphill and hidden from the player. Players who forego the driver from the tee will likely face a mid iron approach shot to a green with a hollow on the right side that creates a two tier look. Expect a back right hole location on Sunday, just as it was when Payne Stewart saved par to win the 1999 U.S. Open."]
    },
    "royalstgeorges_10_FC":{
        "Holes":["Welcome to Royal St George's, host to the 149th Open Championship. Getting a good drive away is essential as your tee shot crosses a valley known as \"The Kitchen\". Three bunkers guard the green on the approach shot. In the 2003 Open Championship, Tiger Woods missed the fairway by 30 yards to the right and lost his ball, which was one of two major disasters that would cost him the Open.","This hole was lengthened for the 2003 Open Championship but remains a good birdie opportunity. The two bunkers on the angle of the dogleg require more carry than some are comfortable with, so many opt for the safer route off the tee to the right of them, which still leaves a shortish iron to a raised green which tilts from back to front and falls away at both sides.","The 3rd hole is a demanding par 3 to a long, narrow green with a ridge halfway up it. In the 1993 Open Championship, this hole ranked the third most difficult despite being the only par 3 on the Open Championship circuit without a bunker.","This was the hardest hole on the course ten years ago, and has since been lengthened by nearly 30 yards while remaining a par four. The huge bunker set in the hill in front of the tee looks to be a huge menace, but once over it, the chance to pick up a shot could produce some thrills and spills. The green has some savage slopes and Out of Bounds awaits anything long.","Normally a layup for position, trying to avoid the bunkers down the left, and then an approach over sand hills to a long green, which has Out of Bounds to the right. In the 2003 Open Championship, helped by a strong following wind, many of the competition cleared the big sand ridge off the tee. Interestingly though, more birdies were made by those playing conservatively short of the sand ridge than by the big hitters.","The hill, known as \"The Maiden\", towers to the left above the green and four bunkers ring this two tiered green where picking the right club is critical, especially in windy conditions. Even though this hole is slightly longer than in the past, it is not a hole that scares many, though still deserves respect.","A blind drive to a fairway which can easily kick the ball into the rough awaits you here at the long par five 7th hole. The fact that it was ranked the easiest hole during the 1993 Open Championship tells it's own story. An opportunity to strike here.","Originally a par three, but now a really tough par four with a drive uphill and then a turn right for a second shot over an area of rough stretching about 80 yards in front of a long, undulating green. Four is never a bad score here, especially if it plays into the wind now that a new tee has added 37 yards.","Those opting for caution off the tee have to be wary of a bunker, once known as \"The Corsets\", pinching in from the right and the humps and hollows of the fairway can produce some nasty bounces. Two bunkers short of the green should not be a problem, but this is a tricky green with big slopes and a major drop away area on the right.","The green at the 10th hole is perched up on high and because the penalty for going long is so severe, many err the other way and come up short. The bunkers on the right are about 10 ft below the surface of the green. Tom Kite went from bunker to bunker for a double bogey six when leading the 1985 Open Championship. There were 16 scores of six or worse here in 1993, more than there were on the par five 7th hole!","A new tee has beefed up the championship length from its previous 216 yards. Five bunkers, three left and two right, catch any wayward shots. New members to Royal St George's are advised early on, never to concede a putt here because so many short ones have been missed over the years.","A dogleg right which ought to yield more birdies than it actually does. Trying to bite too much off the corner can create problems though. Beyond the bunkered ridge is some very undulating land and five more traps are just short of the green. Tiger Woods took 4 putts here in the second round of the 2003 Open Championship.","A blind drive towards a narrow fairway with bunkers left and right, and a further chain of 3 bunkers past that. The green, with Out of Bounds beyond, is 42 yards deep with a ridge down its length.","Probably the most famous hole on the course, with Out of Bounds the entire length to the right and the \"Suez Canal\", so named for its many disasters, across the fairway. The green has been moved back making it out of reach for most when it plays into the wind. There were 22 sevens or worse in the 1993 Open Championship, with one of them costing Bernhard Langer clearly, he finished three behind Greg Norman.","Another demanding hole, with bunkers waiting left and right off the tee and then more sand short of the green. Because of them, approach shots have to carry the whole way to the green which has some steep drops.","No fewer than eight bunkers surround the green, but while capable of causing a headache, the hole is a bit of a breather before the grueling finish. However, in the 2003 Open Championship, the hole wrecked Thomas Bjorn's chances when he took a double bogey five from the right hand bunker and finished 2nd. Tony Jacklin achieved the first ever televised hole in one here during the 1967 Dunlop Masters.","There are many swales in the fairway to be mindful of with your drive. The green is on a raised plateau, causing anything short to roll back down and leave an awkward chip. Paul Lawrie solved that during the 1993 Open Championship by holing his second shot, but it ranked the fourth toughest hole that week. Greg Norman missed an 18 inch putt here that same week!","With new bunkers placed down the left hand side of the fairway, and the cross bunkers being reconfigured slightly, this remains a wonderful finishing hole. Two well hit shots are needed to find the green and left of the putting surface is \"Duncan's Hollow\" so called because, needing a par to tie Walter Hagan in the 1922 Open Championship, George Duncan went down in the dip and failed to get up and down."]
    },
    "olympicclub_11_FC":{
        "Holes":["This hole played as a par 5 in every previous U.S. Open here. The downhill approach shot can be bounced onto the green, but shots that miss long or right will run away quickly.","Many players will hit 3 wood from the tee. The uphill approach shot is to a green that is severely sloped from back to front. It will be difficult to save par from behind the green.","The downhill tee shot to a relatively small green may be affected by the prevailing left to right wind. This hole is likely to play as the most difficult par 3 for the championship.","In classic Olympic fashion, the fairway of this dogleg left hole slopes away to the right. The uphill approach shot is to a green with a severe slope from back left to front right.","This hole plays the opposite of No. 4, with a fairway that slopes to the left, while doglegging significantly to the right. The approach shot plays downhill and typically downwind.","This hole will play some 50 yards longer than it did in the 1998 U.S. Open. A drive of 295 yards is now required to carry the fairway bunker at the turn of this slight dogleg left. ","Players who hit an iron from the tee of this drivable hole will likely have a 70 to 90 yard shot into the two tiered green. Eagles are possible, but one missed shot could lead to bogey.","This new hole will play about 60 yards longer than the previous No. 8. The green slopes from right to left, and is set at an angle. Large cypress trees to the left may come into play.","Though not as dramatic as No. 5, this hole also features a right to left sloping fairway with a dogleg to the right. Any approach shot that misses the green will run away from the hole.","A left to right tee shot will help keep the ball in the fairway on this dogleg right hole. Most players will be hitting short iron approaches into a green that slopes from front to back.","The fairway has been shifted to create a sharper dogleg right. Most players will be able to hit driver from this teeing ground. The green has two tiers and slopes from back to front.","This hole will play 35 yards longer than in 1998, and the drive is out of a narrow, tree lined chute. The approach shot is to a green surrounded by a closely mown area.","An area that formerly played as rough to the left of the green will now play as a closely mown area, so that shots missed to the left can reach the lateral hazard.","The fairway on this dogleg left hole has been shifted to bring trees that border the left side more into play. The preferred tee shot is probably a 3 wood that turns right to left.","Those who miss this green will find just 5 to 6 inch primary rough, with no intermediate cut. Still, most players will hit 9 iron or pitching wedge, making this a birdie opportunity.","This hole, the longest in U.S. Open history, is a sharp dogleg left that keeps turning. Shots that miss the green long or left will bounce farther away, thanks to a closely mown area.","For the first time in a U.S. Open, this hole will play as a par 5, not a par 4. The green slopes severely from left to right and back to front. Eagles will be made, but also some bogey 6s.","Precision is required on both the tee shot and the approach shot. The uphill approach shot is to a small green that slopes from back to front and is surrounded by 5 to 6 inch rough."]
    },
    "oakmont_09_FC":{
        "Holes":["The revered Oakmont Country Club welcomes players in with one of the hardest holes in golf. This long par 4 requires a blind mid iron to a green that slopes away from you and will receive only the crispest of iron shots. Two putts and a par here is a great start.","On this short par 4, a long iron off the teeing ground avoiding the ditch on the left and the bunkers on the right sets up a short iron to an infamous green. You must approach your putt from below the hole; three putts are common from above it.","The famous Church Pews bunker on the left and severe fairway bunkers on the right make for a difficult driving hole. A good drive sets up a short iron to an elevated, but fairly flat green (by Oakmont standards) that slopes slightly away from you.","The Church Pews again penalize an errant drive left and bunkers in the right rough are very severe. However, for the long hitters, this par 5 is reachable and definitely a birdie hole.","Use a long iron off the teeing ground and approach this green with short irons. This very undulating green makes putting difficult, but there should be some birdies here.","On the first of Oakmont's par 3 holes, go with a mid iron shot to a small green that slopes from right to left. Missing the green to the right leads to a sure bogey.","A good drive on this longish par 4 leaves a long iron to another severe green that slopes left to right. To miss this green left is disastrous. Par is a great score on this difficult par 4.","This extremely long par 3 requires a long iron or fairway wood to a fairly long green without much undulation. A bunker called \"Sahara\" some 100 yards long sits to the left of the green, making the tee shot very intimidating.","This very difficult, blind, uphill driving hole has a severe ditch left and severe pot bunkers right. This pivotal hole, which plays as a par 5 for the members, played as a long par 4 for the U.S. Open. The huge, severely undulating green also serves as the practice putting green.","This par 4 features yet another downhill, narrow driving lane with severe fairway bunkers right and left. A short iron follows to a very difficult green that slopes from front right to back left. Four is a great score here.","This short par 4 is best played with a long iron or 3 wood to reach the plateau in the fairway. The short iron approach shot is to a flattish green that slopes from back to front.","Typically a three shot hole, this final par 5 is the toughest one at Oakmont. You may use a 3 wood to hit the sloping fairway, then a long iron for the second shot to set up a wedge third shot. The severe green slopes away from you, making approach shots and putts very difficult.","On this mid iron par 3, the hourglass green is very narrow. A miss long or right makes par a fading fantasy. Stay below the hole to have a better chance for a birdie putt.","This short par 4 requires a long iron off the teeing ground. A short iron second is to a very large green with a lot of subtleties to it. The green generally slopes from right to left, so stay left of the flagstick to have an uphill birdie putt.","This long par 4 features a blind tee shot to a fairway that slopes from left to right. The Church Pews left and severe ditches and bunkers on the right call for another straight drive. A mid to long iron sets up a second shot to a very large green with many difficult subtleties. Take four here and smile going on to 16!","A long iron is needed on this par 3, which has a fairly large green that slopes from left to right. To miss this green to the left is to ask for trouble.","Although some of you can drive this par 4, severe bunkering 50 yards from the green will make you think twice before trying to do so. Either a long iron and wedge over \"Big Mouth\" or a driver to the green makes this hole very exciting.","This is by far the most picturesque hole at Oakmont and perhaps the greatest finishing par 4 in golf. You must drive the fairway to avoid the \"chip out\" bunkers left and right. An uphill mid iron to a very undulating green makes for a great finish!"]
    },
    "congressional_10_FC":{
        "Holes":["The opening hole, a slight dogleg left par 4, provides an early opportunity for birdie. A driver is not required on this relatively short hole and bunkers guard the right side of the tee shot landing area. Regardless of the club played from the teeing ground, players will hit short irons into a green that is relatively large by Congressional standards and is guarded by bunkers at the front and back right.","The longest par 3 on the course will almost certainly play the toughest for the week and begins a difficult three hole stretch. The green is relatively small for the length of the hole and is protected by six bunkers. A ridge runs through the center of the putting surface, which slopes from back left to front right. A 3 is an excellent score for the hole.","A new U.S. Open teeing ground creates a slight dogleg left and adds roughly 10 yards to this par 4. The fairway has been shifted to the right to bring the bunkers in the drive zone into play for the tee shot. The mid iron approach shot is to a large, slightly elevated green flanked by two bunkers on the left and a pair of pot bunkers on the right. The green pitches from back to front, making any miss long a challenging recovery.","A new U.S. Open teeing ground makes this hole play roughly 40 yards longer than it did for the 1997 U.S. Open. The fairway has been shifted to the left to create a sharper dogleg. The mid iron approach is to a green that slopes severely from back to front and bunkers await shots that come up short. The green is one of the most challenging on the course, making par a very good score.","Players will typically hit something less than driver off the teeing ground to reach the crest of the hill at the corner of this dogleg left. The ability to curve the ball right to left will certainly assist a player in hitting this narrow, bending fairway. The green slopes from left to right and shots that miss to the right will likely find a closely mown collection area. If played properly, this par 4 will be a good birdie opportunity.","The sixth hole, which played as a long difficult par 4 in the 1964 and the 1997 U.S. Opens, has been converted to a short, risk/reward par 5. Virtually all the players in the field can reach in two shots. The player who tries to avoid the water hazard on his second shot and overshoots the green will face a testing up and down on a green bisected by a swale.","The seventh hole is a medium length par 3 that plays uphill to a two tiered green. Deep bunkers guard the front of the green, although a player who misses the green in any direction will be left with a very difficult recovery. Regardless of which tier the hole location is on, staying below the hole will be very important on this green that has a pronounced pitch from back to front.","The shortest par 4 on the course presents an excellent birdie opportunity. Most players will opt for something less than driver, leaving themselves a lofted approach. The fairway slopes from left to right while the green has a relatively severe slope from back left to front right. A miss long and left of the green is the one mistake a player cannot afford if he expects to take advantage of this relatively easy hole.","The longest hole on the course has a new back left teeing ground that adds some 30 yards since the 1997 U.S. Open. This is a true three shot par 5, with the third shot likely played with a short iron. A key here is placing the ball in the correct quadrant as two prominent ridges divide the green into three sections.","The new par 3 10th hole replaces the par 3 finishing hole from the 1997 U.S. Open and plays in the opposite direction. Because of the elevated teeing ground, this hole will generally play one club shorter. Any shot that lands short of the green will surely end up in the water. Distance control off the teeing ground will be important because a bailout long will leave a very difficult recovery to a green that slopes back toward the pond.","This hole is likely to play as one of the toughest par 4s on the course. The fairway has been shifted to the right, up against the stream. The player who can play their tee shot on the flat right side of the drive zone will have a distinct advantage playing their approach shot into this very narrow green, which is protected by a pond.","A new U.S. Open teeing ground adds some 55 yards to this dogleg left par 4. The bunker on the outside corner will come into play for most tee shots. The mid iron approach shot is slightly downhill to a green guarded by bunkers at each front corner.","This par 3 features a mid iron tee shot that plays slightly uphill to a heart shaped green with three distinct sections. Players who are long with their tee shots to the narrow front center hole location will find it very difficult to make par because of the steep back to front pitch of the green.","Despite this hole's length, some players may hit less than a driver because the fairway gradually narrows in the drive zone. The mid iron approach shot is to an elevated green that is one of the toughest on the course. If the player is successful in hitting the green in regulation, he will still have work to do on this very undulating green that slopes sharply from back to front.","With a new teeing ground adding some 50 yards for this U.S. Open, the very demanding slight dogleg left hole features four bunkers on the right side of the drive zone. The mid or long iron approach shot is to a dramatically elevated green that slopes back left to front right. Three bunkers guard the front and right of this angled green.","This hole will play the same yardage as it did in 1997, but the fairway bunkers have been moved farther down the drive zone. Any misplayed shot to this elevated green in any direction will translate into a ball that rolls down the hill, as a closely mown area was recently instituted that surrounds the green.","Many players will hit less than a driver to avoid going over the steep hillside at the end of the fairway. The undulating green is divided by pronounced ridges, making it difficult to two putt from the wrong segment of the green.","This demanding par 4 requires a tee shot down the right side to take advantage of the downhill right to left slope in the fairway. That leaves a mid iron approach shot to a peninsula green angled from right to left. The green is bisected, making two putts a challenge when playing from the wrong quadrant. This is one of the great finishing holes in all of championship golf and likely will decide the 111th U.S. Open champion."]
    },
    "standrews_09_FC":{
        "Holes":["Named after the Swilcan Burn which runs through the opening hole and stands guard at the front of the green. When approaching the green, play long to avoid it and make sure to allow enough club.","A partly blind tee shot makes for a tricky start to hole two. Hidden bunkers and savage gorse lie to the right of the fairway, so best to aim left of Cheape's Bunker. The sloping green is fairly shallow so be careful not to overshoot it.","The Principal's Nose cluster of bunkers lies 200 yards down the fairway, but there is plenty of room to the left of the flag before they come into play. An approach slightly to the right of the flag is the safe option avoiding Cartgate bunker. Be prepared to hit a lofted club to a green that slopes away from you.","Once home to Old Daw Anderson's refreshment stand, the Ginger Beer hole offers two options at the tee. Driving down the narrow valley sets up an easier second shot, but for greater safety aim left over the prominent mound. Approach shots from the left will have to carry an array of bunkers , while shots from the right should avoid the large mound 20 yards from the green.","This par 5 is the longest on the front nine and culminates in a massive green, 100 yards deep. Aim your drive just to the left of the Spectacles, a pair of far off bunkers. If you are feeling confident, the ideal line is between the two bunkers, but if the wind is blowing behind you, lay up short. There is a deep swale in front of the green which will gather any approaches left short.","Drive on the marker post to avoid six bunkers up the right and four on the left. To put your approach close to the pin, you will have to negotiate the gully in front of the green. Whether you decide on the chip and run option or the aerial approach, this dip is the only hazard to take into consideration.","The most direct line to the green is straight over the gorse bushes, but you'll have to drive 220 yards to clear them. The less risky can drive straight down the middle to the right side of the large hummock. The approach shot is dominated by the cavernous Shell Bunker in front of the green. The sharply sloping green can make it difficult to put the ball close to the pin.","Aptly named, Short Hole is the shortest at the Old Course. However don't be fooled into thinking that this makes it an easy hole. In the 1995 Open Championship, there were only two birdies here on the first day. The wind blowing off the estuary can make club selection difficult. Be sure to allow enough to clear the Short Hole bunker guarding the front of the green.","From the back of the tee, the perfect line is over the prominent bush avoiding Boase's and End Hole bunkers. There is plenty of room and as long as you have made the fairway, the second shot is straightforward. The flat, round green has no bunkers around it and presents an opportunity to attack the pin.","Aim between the twin bunkers in the foreground, although the fairway widens on the left at the range of a good drive. There are a number of ways you can attack this undulating green. Whatever decision you make, the shot must be hit with conviction. Attack the hole and you will be rewarded.","One of the most celebrated par 3s in the world of golf, the 11th is also one of the most difficult. Guarded by bunkers Hill and Strath, the green falls so severely towards the front that you wonder whether the ball can actually stay on the putting surface. Regardless of the pin position, try to aim between the two large bunkers.","A cluster of hidden bunkers sit in the center of the fairway. The bold solution is to carry them, but failing that, take a line down the left hand side of the fairway. The green is very shallow and the position of the pin in relation to the tier in the green can create formidable problems in putting if your second shot is not placed intelligently.","Drive to the right hand side of the Coffins, a group of bunkers 200 yards from the tee. Wherever you are on the fairway, you will have a second shot that must carry the broken ground before the green. An approach shot cannot possibly be landed short and be expected to roll on. The green is deep and guarded on the right by two bunkers.","The 14th is appropriately named as the longest hole on the Old Course. Aim to the left of the wall and to the right of the Beardies. The second shot could be played onto a portion of the 5th fairway to the left of Hell Bunker, but beware of going out of bounds there. Your approach will do well to hold the green which slopes sharply from front to back.","Drive on the church steeple between the two prominent humps, known as Miss Grainger's bosoms. On the approach take the extra club and play safe into this double green.","Prudent golfers drive to the left of the Principal's Nose cluster of bunkers. The more heroic golfers can try the gap between Principal's Nose and the out of bounds line. On the approach from the left, the shot to the green is threatened by Grant's and Wig bunkers. Allow enough club to clear the large step at the front of the green.","A long par 4, it's not the distance to be carried that tests players, but the route they have to travel. The drive is a blind shot that requires the player to shape the ball into the fairway. On the approach you are faced with a tough shot into a shallow green. Play it long and the ball will lie on the road behind the green. Play it short and the Road Hole bunker lies in wait. Your best bet is to the front right corner of the green.","Start with a drive aimed at the R&A clock. The front of the green is guarded by the Valley of Sin. Aim for the middle of this enormous green and be sure to know your distance. The old buildings surrounding the green will make the yardage appear deceptively short."]
    },
    "kiawah":{
        "Holes":["The Ocean Course opens with a short par four. A good drive in the left center of the fairway will leave a short iron into this gently undulating green tucked into a natural dune area.","Extremely demanding 3 shot par 5. Depending on the result of your drive, either lay up short of the marsh, leaving approximately 140 yards to carry over it, leaving a short wedge to a long but shallow green.","The best angle to this green is from upper or left part of a wide two level fairway. The green is elevated with marsh coming into play long and left.","Keeping your tee shot left of the pot bunkers will give you the best angle to approach the green. Guarded by waste areas front right and dunes behind has made this a very challenging par.","This par 3 green is divided in half by a huge ridge. If the hole is on the left half of the green, add at least one club. Watch the wind here. Putts from the opposite side of the ridge will be challenging.","This medium length par 4 offers a wide fairway with a waste bunker and a pond protecting the left side. The approach to this deep green is open in the front while protected by a waste area to the right and additional bunkers to the left.","This second of the par 5s is reachable in two. Fairway narrows toward the green about 50 yards out. If players think their way through it, this hole will yield birdies.","A wide two level green that narrows at the back where it slopes down. A short middle iron to the center of the green will always leave a reasonable two putt. This green is guarded by a waste area on the right and behind.","Visually intimidating, however the fairway is quite wide. The green accepts shots more readily than it appears. A right to left approach from the right center of the fairway is desired here. Watch for a deep pot bunker behind this green.","This is a big risk/reward hole when aiming over the waste bunker off the tee. If you miss, you will be staring at the bunker's huge wall forcing a lay up. If you can get it over, you'll have a short wedge down the length of the green.","This hole requires the golfer to avoid bunkers that guard the inside of each turn. Two good shots should set up a short approach to a deep green set high atop a dune ridge and guarded in front by more deep bunkers.","Perhaps the widest fairway on the course gives way to one of the narrowest approaches at No.12. A good drive here sets up a downhill second shot to a green guarded closely by the canal, dunes and thick native grasses. Though narrow, the approach is open in the front, with a rolling collar area providing some room to miss the left.","Players electing to take the \"safe\" route away from the water may find one of two deep, pot bunker like waste areas guarding the left side. This is another classic risk/reward hole.","The first par 3 on the back nine provides a spectacular view of the ocean. The only place to miss it is front right. Miss it anywhere else and you'll have a hard time recovering. There's quite a bit of room behind this green but it's a tough up and down.","Short irons will be the scoring clubs at this medium length par 4. The approach is to a green running diagonally away from the golfer from the right. Waste areas are left and back right of this green which is perched high on a dune ridge.","A straight away par 5, No.16 will require the player to carry his drive over a pond to reach a terraced fairway that is higher to the right side. The toughest part of this hole is your third shot. It's a very intimidating shot where having the correct yardage is essential.","The green appears narrow, and is fiercely guarded by water to the front and right. Be sure to pay special attention to the wind as your approach is all carry. Any shot that finds land here is a good one.","The best drive will be one that hugs the right side of the fairway. That will set up a second shot to an elevated green open from the right and running away to the back left. An excellent finishing hole!"]
    },
    "pganational_21_FC":{
        "Holes":["Short first hole with water left and OB right, as the fairway narrows at the bunker. Deep narrow green has a deep pot bunker in the front that must be avoided. Bailout is to the right of the green.","N/A","Choose your approach wisely as the front portion of the green is extremely narrow, sandwiched by deep bunkers. Take enough club if the pin is back, and leaving it short is not bad for a front pin.","A short, dogleg left par 4 with room right off the tee. Distance control for the second shot is crucial, as the wide shallow green is angled left to right. Deep bunkers in front and back of the green, cradling a narrow green, makes this one of the tougher short holes.","This par 3 has water short and left with a bailout right. Bowl mid right on the green makes back pins difficult. Arguably the easiest par 3 on the course, it can be a beast if the tees are stretched to the back.","N/A","N/A","Check the wind carefully before deciding on a club, as the prevailing wind may be blocked off by the trees surrounding this green. Green slopes back to front and left to right, but generous areas makes for easy putting anywhere from the middle.","Slight dogleg left with trees left and bunker right. Elevated green is covered by a bunker front left, so take an extra club as a precaution. Green is angled back left to front right, with a bailout area short right of the green.","N/A","Fairway runs out to the right, as water can come into play on this difficult par 4. Second shot is brutal without perfect distance, as water guards the front and bunker back left. With the green angled front left to back right, there is very little forgiveness on the approach apart from a small area left of the green.","N/A","N/A","N/A","N/A","The longer you hit your drive, the tighter the fairway becomes. Shortest approach is from the right side of the fairway, but that involves negotiating the bunker and the water. Approach to a 2 tiered green is over water with a generous bailout short of the green.","Water guards the front of this par 3 that plays slightly downhill. Bunker behind green leaves difficult shot to a green that slopes towards the water. Accurate club selection is a must with a bailout area to the left.","N/A"]
    }
}
